In [1]:
import pandas as pd
import numpy as np

In [3]:
df= pd.read_csv("energydata_complete.csv")
df.head().T

,0,1,2,3,4
date,2016-01-11 17:00:00,2016-01-11 17:10:00,2016-01-11 17:20:00,2016-01-11 17:30:00,2016-01-11 17:40:00
Appliances,60,60,50,50,60
lights,30,30,30,40,40
T1,19.89,19.89,19.89,19.89,19.89
RH_1,47.596667,46.693333,46.3,46.066667,46.333333
T2,19.2,19.2,19.2,19.2,19.2
RH_2,44.79,44.7225,44.626667,44.59,44.53
T3,19.79,19.79,19.79,19.79,19.79
RH_3,44.73,44.79,44.933333,45.0,45.0
T4,19.0,19.0,18.926667,18.89,18.89
RH_4,45.566667,45.9925,45.89,45.723333,45.53
T5,17.166667,17.166667,17.166667,17.166667,17.2
RH_5,55.2,55.2,55.09,55.09,55.09
T6,7.026667,6.833333,6.56,6.433333,6.366667
RH_6,84.256667,84.063333,83.156667,83.423333,84.893333
T7,17.2,17.2,17.2,17.133333,17.2
RH_7,41.626667,41.56,41.433333,41.29,41.23
T8,18.2,18.2,18.2,18.1,18.1
RH_8,48.9,48.863333,48.73,48.59,48.59
T9,17.033333,17.066667,17.0,17.0,17.0
RH_9,45.53,45.56,45.5,45.4,45.4
T_out,6.6,6.483333,6.366667,6.25,6.133333
Press_mm_hg,733.5,733.6,733.7,733.8,733.9
RH_out,92.0,92.0,92.0,92.0,92.0
Windspeed,7.0,6.666667,6.333333,6.0,5.666667
Visibility,63.0,59.166667,55.333333,51.5,47.666667
Tdewpoint,5.3,5.2,5.1,5.0,4.9
rv1,13.275433,18.606195,28.642668,45.410389,10.084097
rv2,13.275433,18.606195,28.642668,45.410389,10.084097

In [3]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
lst

[[35, 'Portugal', 94], [33, 'Argentina', 93], [30, 'Brazil', 92]]

In [4]:
col = ["Age","Nationality","Overall"]
col

['Age', 'Nationality', 'Overall']

In [5]:
pd.DataFrame(lst, columns=col, index=[i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [6]:
y = [(2, 4), (7, 8), (1, 5, 9)]
y

[(2, 4), (7, 8), (1, 5, 9)]

In [7]:
x = y[1][1]
x

8

In [8]:
array  = np.array([[94, 89, 63],

             [93, 92, 48],

             [92, 94, 56]])
array

array([[94, 89, 63],
       [93, 92, 48],
       [92, 94, 56]])

In [9]:
array[:2, 1:]

array([[89, 63],
       [92, 48]])

In [10]:
df[ df["Area"]=="Madagascar" ]

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
30715,129,Madagascar,2501,Population,511,Total Population - Both sexes,1000 persons,23590.00,24234.00,24894.00,25571.00,26262.00
30716,129,Madagascar,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
30717,129,Madagascar,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,1986.00,1922.00,1918.00,1943.00,1938.00
30718,129,Madagascar,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,44.45,43.26,43.35,43.94,44.17
30719,129,Madagascar,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,22.18,22.97,23.83,25.26,24.12
...,...,...,...,...,...,...,...,...,...,...,...,...
32149,129,Madagascar,2899,Miscellaneous,5142,Food,1000 tonnes,10.00,11.00,11.00,11.00,12.00
32150,129,Madagascar,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,0.44,0.44,0.44,0.44,0.44
32151,129,Madagascar,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,0.00,0.00,0.00,0.00,0.00
32152,129,Madagascar,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.01,0.01,0.01,0.01,0.01
32153,129,Madagascar,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.01,0.01,0.01,0.01,0.01

In [11]:
search="Protein supply quantity (g/capita/day)"

df[ (df["Area"]=="Madagascar") &  (df["Element"] == search) ].loc[:,"Y2015"].sum()

173.04999999999998

In [12]:
sum_per_element_df = df[ ["Element","Y2017"] ].groupby(["Element"], as_index=False).sum() #.loc[:,"Y2017"].count()
sum_per_element_df.head()

                              Element       Y2017
0            Domestic supply quantity  2088198.10
1                     Export Quantity   182338.80
2  Fat supply quantity (g/capita/day)    10253.84
3                                Feed   223705.68
4                                Food  1258888.28

In [13]:
sum_per_element_df[ sum_per_element_df["Element"]=="Processing" ].loc[:,"Y2017"].sum()

292836.0

In [14]:
s = [['him', 'sell'], [90, 28, 43]]
s

[['him', 'sell'], [90, 28, 43]]

In [15]:
s[0][1][1]

'e'

In [16]:
df["Area"].nunique()

49

In [17]:
sum_per_area_2017 = df[ ["Area","Y2017"] ].groupby("Area", as_index=False).sum() \
                                            .sort_values("Y2017") \
                                            .reset_index()
sum_per_area_2017.head(10)

   index                   Area     Y2017
0     42         Sudan (former)      0.00
1     16           Ethiopia PDR      0.00
2      9                Comoros     59.84
3     38             Seychelles    442.34
4     36  Sao Tome and Principe  12662.63
5      5             Cabo Verde  14650.74
6     21          Guinea-Bissau  19102.77
7     23                Lesotho  21267.96
8      3               Botswana  22101.30
9     12               Djibouti  22729.91

In [18]:
sum_per_area_2017.iloc[6,:]

index               21
Area     Guinea-Bissau
Y2017         19102.77
Name: 6, dtype: object

In [19]:
df.iloc[:].head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [20]:
df.shape

(60943, 12)

In [21]:
sum_per_item = df[ ["Item","Y2015","Y2018"] ].groupby("Item", as_index=False).sum()
sum_per_item

                    Item      Y2015      Y2018
0      Alcohol, Non-Food    2180.00    2293.00
1    Alcoholic Beverages   98783.72   97847.27
2        Animal Products   11811.73   11578.61
3            Animal fats  200675.72  269648.27
4    Apples and products   10559.15    9640.51
..                   ...        ...        ...
114    Vegetables, Other  158104.08  163987.21
115     Vegetal Products  107064.17  107775.39
116   Wheat and products  234710.51  242645.19
117                 Wine    4251.81    4039.32
118                 Yams  203151.78  221272.09

[119 rows x 3 columns]

In [22]:
sum_per_item[ sum_per_item["Item"]=="Wine" ]

     Item    Y2015    Y2018
117  Wine  4251.81  4039.32

In [23]:
df.isnull().sum()

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

In [24]:
df.isnull().sum()["Y2014"] / df.shape[0]

0.026073544131401474

In [25]:
corr_df = df.corr()
corr_df

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Area Code,1.000000,-0.005159,-0.000209,0.006164,0.005472,0.005247,0.005006,0.005665
Item Code,-0.005159,1.000000,-0.024683,0.021722,0.020857,0.020109,0.021494,0.021314
Element Code,-0.000209,-0.024683,1.000000,0.024457,0.023889,0.023444,0.024254,0.024279
Y2014,0.006164,0.021722,0.024457,1.000000,0.994647,0.996081,0.995230,0.994872
Y2015,0.005472,0.020857,0.023889,0.994647,1.000000,0.995739,0.988048,0.988208
Y2016,0.005247,0.020109,0.023444,0.996081,0.995739,1.000000,0.992785,0.992757
Y2017,0.005006,0.021494,0.024254,0.995230,0.988048,0.992785,1.000000,0.998103
Y2018,0.005665,0.021314,0.024279,0.994872,0.988208,0.992757,0.998103,1.000000

In [26]:
corr_df.loc["Element Code", "Y2014":]

Y2014    0.024457
Y2015    0.023889
Y2016    0.023444
Y2017    0.024254
Y2018    0.024279
Name: Element Code, dtype: float64

In [27]:
corr_df.loc["Element Code", "Y2014":].min()

0.02344399758496104

In [28]:
sum_per_area_2017 = df[ ["Area","Y2017"] ].groupby("Area", as_index=False).sum() \
                                            .sort_values("Y2017", ascending=False) \
                                            .reset_index()
sum_per_area_2017.head()

   index          Area       Y2017
0     34       Nigeria  1483268.23
1     13         Egypt   866379.92
2     40  South Africa   517590.54
3     15      Ethiopia   448683.76
4     30       Morocco   388495.36

In [29]:
df.groupby("Element", as_index=False).sum().var()

Area Code       6.455361e+10
Item Code       2.544745e+13
Element Code    1.089441e+14
Y2014           4.232010e+11
Y2015           4.353167e+11
Y2016           4.418194e+11
Y2017           4.653693e+11
Y2018           4.955863e+11
dtype: float64

In [30]:
df["Y2017"].describe()

count     59437.000000
mean        140.917765
std        1671.862359
min       -1582.000000
25%           0.000000
50%           0.100000
75%           9.000000
max      190873.000000
Name: Y2017, dtype: float64

In [31]:
my_tuppy = (1,2,5,8)
my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment